"""
Пакет для настройки и использования логгера приложения.
"""

__version__ = '1.0.0'
__author__ = 'Roman Romanovskiy'

# --------------------------------------------------------

from logger.app_logger import AppLogger

# --------------------------------------------------------

# Глобальный экземпляр логгера для использования во всём приложении
app_logger = AppLogger()

# --------------------------------------------------------

__all__ = [
    'AppLogger',
    'app_logger',
]

# --------------------------------------------------------